/* Non-user-facing error text for a connection that has been closed due to a timeout. */
"GCDAsyncSocketClosedError" = "Socket closed by remote peer";

/* Non-user-facing error text for an attempted connection that has failed due to a timeout. */
"GCDAsyncSocketConnectTimeoutError" = "Attempt to connect to host timed out";

/* No comment provided by engineer. */
"GCDAsyncSocketOtherError" = "Poging om socket te maken van socket FD is mislukt. getpeername() is mislukt";

/* Non-user-facing error text for a read operation that has read the maximum amount of allowed data. */
"GCDAsyncSocketReadMaxedOutError" = "Read operation reached set maximum length";

/* Non-user-facing error text for a read operation that has failed due to a timeout. */
"GCDAsyncSocketReadTimeoutError" = "Read operation timed out";

/* Non-user-facing error text for a write operation that has failed due to a timeout. */
"GCDAsyncSocketWriteTimeoutError" = "Write operation timed out";

